Repository: Exmeaning/ClickZen
Catalog: src/ClickZen.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# Auto_Stepping
source: Running one round…
zh_cn: 正在执行一轮…

# Auto_StepDone
source: Step done (round {0})
zh_cn: 单步完成（第 {0} 轮）

# Auto_RunStatus
source: Running: {0} device(s) · {1} round(s) · last fired: {2}
zh_cn: 运行中：{0} 台设备 · {1} 轮 · 最近触发：{2}

# Auto_RunFinished
source: Stopped: {0} round(s) · last fired: {1}
zh_cn: 已停止：{0} 轮 · 最近触发：{1}

# Workbench_Freeze.ToolTipService.ToolTip
source: Freeze the picture
zh_cn: 冻结画面

# Workbench_Refresh.ToolTipService.ToolTip
source: Show the newest picture
zh_cn: 刷新为最新画面

# Workbench_CancelPick.ToolTipService.ToolTip
source: Cancel (Esc)
zh_cn: 取消（Esc）

# Workbench_NoPicture.Text
source: No picture
zh_cn: 没有画面

# Workbench_ModeLive
source: Live picture
zh_cn: 实时画面

# Workbench_ModeFrozen
source: Frozen
zh_cn: 已冻结

# Workbench_ModePoint
source: Click the picture to pick a point (Esc to cancel)
zh_cn: 单击画面取点（Esc 取消）

# Workbench_ModeArea
source: Drag to select an area (Esc to cancel)
zh_cn: 拖拽框选区域（Esc 取消）

# Workbench_PickPointHint
source: Click the position on the picture on the right.
zh_cn: 在右侧画面上单击要使用的位置。

# Workbench_PickAreaHint
source: Drag a rectangle on the picture on the right.
zh_cn: 在右侧画面上拖拽框选区域。

# Workbench_CaptureHint
source: Drag a rectangle around the part of the picture to capture as a template.
zh_cn: 在右侧画面上拖拽框选要截取为模板的区域。

# Editor_Placeholder.Text
source: Select a task on the left to edit it
zh_cn: 选择左侧的任务进行编辑

# Editor_BasicHeader.Text
source: Basics
zh_cn: 基本信息

# Editor_BasicHint.Text
source: Cooldown starts when the task finishes; higher priority tasks are checked first within a round; a run limit of 0 means unlimited.
zh_cn: 冷却从任务执行完成后开始计时；优先级高的任务在同一轮中先判断；运行次数上限为 0 表示不限。

# Editor_TaskEnabled.OnContent
source: Enabled
zh_cn: 已启用

# Editor_TaskEnabled.OffContent
source: Disabled
zh_cn: 已停用

# Editor_TaskName.Header
source: Task name
zh_cn: 任务名称

# Editor_TaskName.PlaceholderText
source: e.g. Collect daily reward
zh_cn: 例如：领取每日奖励

# Editor_Cooldown.Header
source: Cooldown (ms)
zh_cn: 冷却 (ms)

# Editor_Priority.Header
source: Priority
zh_cn: 优先级

# Editor_RunLimit.Header
source: Run limit
zh_cn: 运行次数上限

# Editor_PreconditionHeader.Text
source: Precondition
zh_cn: 前置条件

# Editor_PreconditionHint.Text
source: Checked first every round; the rules below are only considered when it holds. Empty means always.
zh_cn: 每一轮先判断前置条件，满足后才会依次判断下面的规则。留空表示总是满足。

# Editor_RulesHeader.Text
source: Rules
zh_cn: 规则

# Editor_RulesHint.Text
source: Rules are checked in order; when a rule's conditions hold its actions run. "Stop after match" skips the remaining rules this round.
zh_cn: 规则按顺序判断：条件满足时执行对应动作。勾选“匹配后停止”可跳过本轮剩余规则。

# Editor_ExpandAll
source: Expand all rules
zh_cn: 展开所有规则

# Editor_CollapseAll
source: Collapse all
zh_cn: 全部折叠

# Editor_EnabledTip
source: Enable / disable
zh_cn: 启用 / 停用

# Editor_MoveUp
source: Move up
zh_cn: 上移

# Editor_MoveDown
source: Move down
zh_cn: 下移

# Editor_More
source: More
zh_cn: 更多操作

# Editor_Duplicate
source: Duplicate
zh_cn: 复制一份

# Editor_Delete
source: Delete
zh_cn: 删除

# Editor_CopyOf
source: {0} copy
zh_cn: {0} 副本

# Editor_NotSet
source: (not set)
zh_cn: （未设置）

# Editor_Err_Host
source: Operation failed: {0}
zh_cn: 操作失败：{0}

# Editor_W
source: Width
zh_cn: 宽

# Editor_H
source: Height
zh_cn: 高

# Editor_Point
source: Point
zh_cn: 坐标

# Editor_Area
source: Area
zh_cn: 区域

# Editor_Offset
source: Offset (dx, dy)
zh_cn: 偏移 (dx, dy)

# Editor_FallbackPoint
source: Fallback point when nothing matched
zh_cn: 未匹配时使用的坐标

# Editor_PickPoint
source: Pick a point on the picture
zh_cn: 在画面上取点

# Editor_PickArea
source: Select an area on the picture
zh_cn: 在画面上框选

# Editor_ClearArea
source: Clear area (whole screen)
zh_cn: 清除区域（全屏）

# Editor_Target
source: Target
zh_cn: 目标位置

# Editor_Target_Point
source: Fixed point
zh_cn: 固定坐标

# Editor_Target_LastMatch
source: Last image match
zh_cn: 最近一次图像匹配位置

# Editor_Target_RandomInArea
source: Random point in area
zh_cn: 区域内随机位置

# Editor_Target_LastMatchHint
source: Uses the centre of the latest image match in this rule (or the precondition); falls back to the point below.
zh_cn: 使用本规则（或前置条件）中最近一次图像匹配的中心；没有匹配时退回到下面的坐标。

# Editor_Target_LastMatchShort
source: match
zh_cn: 匹配位置

# Editor_Target_RandomShort
source: random in {0}
zh_cn: 随机于 {0}

# Editor_AddCondition
source: Add condition
zh_cn: 添加条件

# Editor_AddSubgroup
source: Add subgroup
zh_cn: 添加子组

# Editor_DeleteGroup
source: Delete subgroup
zh_cn: 删除子组

# Editor_LogicTip
source: How the conditions in this group combine
zh_cn: 组内条件的组合方式

# Editor_Logic_All
source: All
zh_cn: 全部

# Editor_Logic_Any
source: Any
zh_cn: 任一

# Editor_Logic_None
source: None
zh_cn: 都不

# Editor_LogicLong_All
source: All of (All)
zh_cn: 全部满足 (All)

# Editor_LogicLong_Any
source: Any of (Any)
zh_cn: 任一满足 (Any)

# Editor_LogicLong_None
source: None of (None)
zh_cn: 都不满足 (None)

# Editor_LogicHint_All
source: True when every item below is true
zh_cn: 下列条件全部为真时成立

# Editor_LogicHint_Any
source: True when at least one item below is true
zh_cn: 下列条件任一为真时成立

# Editor_LogicHint_None
source: True when no item below is true
zh_cn: 下列条件都为假时成立

# Editor_GroupEmptyPass
source: Empty: always true
zh_cn: 空组：总是成立

# Editor_GroupEmptyAny
source: Empty: never true in "Any" mode
zh_cn: 空组：“任一”模式下永远不成立

# Editor_Sum_Group
source: {0} ({1} items)
zh_cn: {0}（{1} 项）

# Editor_Sum_GroupEmpty
source: {0} (empty)
zh_cn: {0}（空）

# Editor_Cond_Image
source: Image
zh_cn: 图像

# Editor_Cond_Color
source: Colour
zh_cn: 颜色

# Editor_Cond_Expression
source: Expression
zh_cn: 表达式

# Editor_Cond_Elapsed
source: Elapsed time
zh_cn: 时间

# Editor_Label
source: Label
zh_cn: 备注名

# Editor_LabelPlaceholder
source: Optional, shown in the list
zh_cn: 可选，显示在列表中

# Editor_Template
source: Template
zh_cn: 模板

# Editor_NoTemplate
source: (no template)
zh_cn: （未选择模板）

# Editor_TemplateMissing
source: Missing template: {0}
zh_cn: 缺失的模板：{0}

# Editor_CaptureTemplate
source: Capture template
zh_cn: 截取新模板

# Editor_SearchArea
source: Search area
zh_cn: 搜索区域

# Editor_WholeScreen
source: whole screen
zh_cn: 全屏

# Editor_WholeScreenHint
source: An empty area searches the whole screen (slower).
zh_cn: 区域为空时搜索整个屏幕（较慢）。

# Editor_Threshold
source: Similarity threshold
zh_cn: 相似度阈值

# Editor_Grayscale
source: Grayscale
zh_cn: 灰度匹配

# Editor_MultiScale
source: Multi-scale
zh_cn: 多尺度

# Editor_Expect
source: Expect
zh_cn: 期望

# Editor_ExpectFound
source: Found
zh_cn: 存在

# Editor_ExpectAbsent
source: Not found
zh_cn: 不存在

# Editor_ExpectMatch
source: Colour matches
zh_cn: 颜色匹配

# Editor_ExpectNoMatch
source: Colour does not match
zh_cn: 颜色不匹配

# Editor_Color
source: Colour
zh_cn: 颜色

# Editor_Tolerance
source: Tolerance (0–255)
zh_cn: 容差 (0–255)

# Editor_ColorHint
source: Enter the colour as #RRGGBB; tolerance is the maximum difference per channel. The Mirror page's pick mode shows pixel colours.
zh_cn: 颜色按 #RRGGBB 输入；容差是每个通道允许的最大差值。可先在投屏页的取点模式中查看像素颜色。

# Editor_Expression
source: Expression
zh_cn: 表达式

# Editor_ExpressionHint
source: Supports arithmetic, comparison, logic (&& || !), strings and functions such as rand/min/max/abs/round/len; built-ins like $match.x and $elapsed.
zh_cn: 支持算术、比较、逻辑 (&& || !)、字符串和函数 rand/min/max/abs/round/len 等；内置变量如 $match.x、$elapsed。

# Editor_ElapsedSince
source: Since
zh_cn: 起点

# Editor_Since_TaskLastRun
source: This task last ran
zh_cn: 本任务上次运行

# Editor_Since_SchemeStart
source: Scheme start
zh_cn: 方案启动

# Editor_AtLeastMs
source: At least (ms)
zh_cn: 至少经过 (ms)

# Editor_Test
source: Test
zh_cn: 测试

# Editor_TestTip
source: Evaluate once on the current picture and show the result on the workbench
zh_cn: 在当前画面上执行一次判断，并在工作台显示结果

# Editor_Test_Matched
source: Matched
zh_cn: 成立

# Editor_Test_NotMatched
source: Not matched
zh_cn: 不成立

# Editor_Test_Score
source: score {0}
zh_cn: 分数 {0}

# Editor_Test_Distance
source: difference {0}
zh_cn: 差值 {0}

# Editor_Test_At
source: at {0}
zh_cn: 位置 {0}

# Editor_Test_NeedTemplate
source: Choose or capture a template first.
zh_cn: 请先选择或截取模板。

# Editor_Test_Unavailable
source: Cannot test right now (no picture, or another operation is in progress).
zh_cn: 当前无法测试（没有画面或正在进行其他操作）。

# Editor_Sum_Image
source: find {0} (≥ {1}, {2})
zh_cn: 找到 {0}（≥ {1}，{2}）

# Editor_Sum_ImageAbsent
source: {0} absent (≥ {1}, {2})
zh_cn: 未找到 {0}（≥ {1}，{2}）

# Editor_Sum_Color
source: ({0}) is {1} ±{2}
zh_cn: ({0}) 为 {1} ±{2}

# Editor_Sum_ColorNot
source: ({0}) is not {1} ±{2}
zh_cn: ({0}) 不是 {1} ±{2}

# Editor_Sum_ElapsedTask
source: ≥ {0} since last run
zh_cn: 距上次运行 ≥ {0}

# Editor_Sum_ElapsedStart
source: ≥ {0} since start
zh_cn: 距方案启动 ≥ {0}

# Editor_Err_Expression
source: Expression error: {0}
zh_cn: 表达式错误：{0}

# Editor_Err_EmptyExpression
source: The expression cannot be empty.
zh_cn: 表达式不能为空。

# Editor_Err_Placeholder
source: Placeholder {{{0}}} is invalid: {1}
zh_cn: 占位符 {{{0}}} 有误：{1}

# Editor_Err_EmptyPlaceholder
source: Empty placeholder {{}} at character {0}.
zh_cn: 第 {0} 个字符处的占位符 {{}} 为空。

# Editor_Err_Unclosed
source: The {{ at character {0} is not closed and will be output as is (write {{{{ and }}}} for literal braces).
zh_cn: 第 {0} 个字符处的 {{ 没有闭合，将按原样输出（字面量花括号请写 {{{{ 和 }}}}）。

# Editor_Err_Color
source: Colour must be #RRGGBB.
zh_cn: 颜色格式应为 #RRGGBB。

# Editor_Err_KeyCode
source: Choose a key or enter a key code between 0 and 1000.
zh_cn: 请选择一个按键，或输入 0–1000 之间的键码。

# Editor_Warn_Undeclared
source: Undeclared variables (read as 0): {0}
zh_cn: 未声明的变量（按 0 处理）：{0}

# Editor_PlaceholderHint
source: Insert values with {expression}, e.g. {count + 1}; write {{ and }} for literal braces.
zh_cn: 用 {表达式} 插入变量值，例如 {count + 1}；字面量花括号写 {{ 和 }}。

# Editor_AddRule
source: Add rule
zh_cn: 添加规则

# Editor_NoRules
source: No rules yet. Add a rule with conditions and the actions to run.
zh_cn: 还没有规则。添加一条规则，设置条件和要执行的动作。

# Editor_RuleN
source: Rule {0}
zh_cn: 规则 {0}

# Editor_RuleName
source: Rule name
zh_cn: 规则名称

# Editor_When
source: When
zh_cn: 当

# Editor_WhenHint
source: The actions below run when this holds; empty means always.
zh_cn: 条件成立时执行下面的动作；留空表示总是执行。

# Editor_Then
source: Then
zh_cn: 执行

# Editor_Pick
source: Execution
zh_cn: 执行方式

# Editor_Pick_Sequential
source: Run all actions in order
zh_cn: 按顺序执行全部动作

# Editor_Pick_RandomOne
source: Run one branch chosen by weight
zh_cn: 按权重随机执行一个分支

# Editor_StopAfterMatch
source: Stop after match
zh_cn: 匹配后停止

# Editor_StopAfterMatchTip
source: After this rule runs, skip the task's remaining rules this round
zh_cn: 本规则执行后，跳过本任务在这一轮剩余的规则

# Editor_SequentialHint
source: Actions run in order.
zh_cn: 动作按顺序执行。

# Editor_RandomHint
source: Each time the rule fires one branch is picked at random by weight. Branches with weight 0 are never picked.
zh_cn: 每次触发时按权重随机选出一个分支执行。权重为 0 的分支不会被选中。

# Editor_Sum_Always
source: always
zh_cn: 总是

# Editor_Sum_RuleConditions
source: {0} conditions
zh_cn: {0} 个条件

# Editor_Sum_RuleActions
source: {0} actions
zh_cn: {0} 个动作

# Editor_Sum_RuleBranches
source: random of {0} branches
zh_cn: 随机 {0} 个分支

# Editor_AddBranch
source: Add branch
zh_cn: 添加分支

# Editor_BranchN
source: Branch {0}
zh_cn: 分支 {0}

# Editor_BranchName
source: Branch name
zh_cn: 分支名称

# Editor_Weight
source: Weight
zh_cn: 权重

# Editor_WeightTip
source: The chance of being picked is proportional to the weight
zh_cn: 被选中的概率与权重成正比

# Editor_Sum_Branch
source: {0} · weight {1} ({2}) · {3} actions
zh_cn: {0} · 权重 {1}（{2}） · {3} 个动作

# Editor_AddAction
source: Add action
zh_cn: 添加动作

# Editor_NoActions
source: No actions yet.
zh_cn: 还没有动作。

# Editor_Act_Tap
source: Tap
zh_cn: 点击

# Editor_Act_LongPress
source: Long press
zh_cn: 长按

# Editor_Act_Swipe
source: Swipe
zh_cn: 滑动

# Editor_Act_Key
source: Key
zh_cn: 按键

# Editor_Act_Text
source: Type text
zh_cn: 输入文本

# Editor_Act_Wait
source: Wait
zh_cn: 等待

# Editor_Act_PlayRecording
source: Play recording
zh_cn: 播放录制

# Editor_Act_SetVariable
source: Set variable
zh_cn: 设置变量

# Editor_Act_AdbShell
source: ADB shell
zh_cn: ADB 命令

# Editor_Act_Log
source: Log
zh_cn: 写日志

# Editor_Act_Stop
source: Stop
zh_cn: 停止

# Editor_TapCount
source: Count
zh_cn: 次数

# Editor_IntervalMs
source: Interval (ms)
zh_cn: 间隔 (ms)

# Editor_DurationMs
source: Duration (ms)
zh_cn: 时长 (ms)

# Editor_SwipeFrom
source: From
zh_cn: 起点

# Editor_SwipeTo
source: To
zh_cn: 终点

# Editor_Key
source: Key
zh_cn: 按键

# Editor_KeyPlaceholder
source: Choose or type a key code
zh_cn: 选择或输入键码

# Editor_KeyHint
source: You can type an Android key code, e.g. 61 (Tab).
zh_cn: 可直接输入 Android 键码数字，例如 61 (Tab)。

# Editor_Key_Back
source: Back
zh_cn: 返回

# Editor_Key_Home
source: Home
zh_cn: 主页

# Editor_Key_AppSwitch
source: Recent apps
zh_cn: 最近任务

# Editor_Key_Power
source: Power
zh_cn: 电源

# Editor_Key_VolumeUp
source: Volume up
zh_cn: 音量 +

# Editor_Key_VolumeDown
source: Volume down
zh_cn: 音量 -

# Editor_Key_Enter
source: Enter
zh_cn: 回车

# Editor_Key_Delete
source: Delete
zh_cn: 删除

# Editor_Text
source: Text
zh_cn: 文本

# Editor_MinMs
source: Minimum (ms)
zh_cn: 最短 (ms)

# Editor_MaxMs
source: Maximum (ms)
zh_cn: 最长 (ms)

# Editor_WaitHint
source: When the maximum is greater than the minimum a random wait in between is used; otherwise the minimum.
zh_cn: 最长大于最短时，在两者之间随机等待；否则固定等待最短时长。

# Editor_Recording
source: Recording
zh_cn: 录制

# Editor_RecordingPlaceholder
source: Embedded recording, or a path relative to the scheme file
zh_cn: 方案内的录制，或相对方案文件的路径

# Editor_RecordingHint
source: The list shows recordings embedded in the scheme; you can also type a .czrec path relative to the scheme file.
zh_cn: 下拉列表中是方案内嵌的录制；也可以输入相对于方案文件的 .czrec 路径。

# Editor_Speed
source: Speed
zh_cn: 速度

# Editor_Loops
source: Loops
zh_cn: 循环次数

# Editor_Variable
source: Variable
zh_cn: 变量

# Editor_VariablePlaceholder
source: Variable name
zh_cn: 变量名

# Editor_ValueExpression
source: New value (expression)
zh_cn: 新值（表达式）

# Editor_Command
source: Command
zh_cn: 命令

# Editor_AsRoot
source: Run as root (su)
zh_cn: 以 su 执行

# Editor_OutputVariable
source: Save output to variable
zh_cn: 输出保存到变量

# Editor_OutputVariablePlaceholder
source: Optional
zh_cn: 可选

# Editor_Message
source: Message
zh_cn: 消息

# Editor_StopScope
source: Scope
zh_cn: 停止范围

# Editor_Stop_Task
source: Disable this task (for this run)
zh_cn: 停用本任务（本次运行内）

# Editor_Stop_Scheme
source: Stop the whole scheme
zh_cn: 停止整个方案

# Editor_DelayAfter
source: Delay after (ms)
zh_cn: 执行后等待 (ms)

# Editor_DelayDefault
source: Default {0}
zh_cn: 默认 {0}

# Editor_Sum_PlayRecording
source: {0}, {1}×, {2} loops
zh_cn: {0}，{1}×，{2} 次

# Editor_Sum_StopTask
source: disable this task
zh_cn: 停用本任务

# Editor_Sum_StopScheme
source: stop the scheme
zh_cn: 停止方案

# Editor_Sum_Delay
source: then wait {0} ms
zh_cn: 之后等待 {0} ms

# Vars_SchemeLabel.Text
source: Scheme:
zh_cn: 方案：

# Vars_ViewPicker.Header
source: Show values from
zh_cn: 显示数值来自

# Vars_ViewGlobal
source: Global variables
zh_cn: 全局变量

# Vars_ViewDevice
source: {0} (scheme variables)
zh_cn: {0}（方案变量）

# Vars_Add.ToolTipService.ToolTip
source: Declare a new variable in the scheme
zh_cn: 在方案中声明一个新变量

# Vars_AddText.Text
source: New variable
zh_cn: 新建变量

# Vars_ColName.Text
source: Name
zh_cn: 名称

# Vars_ColType.Text
source: Type
zh_cn: 类型

# Vars_ColScope.Text
source: Scope
zh_cn: 作用域

# Vars_ColSync.Text
source: Network sync
zh_cn: 网络同步

# Vars_ColInitial.Text
source: Initial value
zh_cn: 初值

# Vars_ColValue.Text
source: Current value (editable)
zh_cn: 当前值（可修改）

# Vars_TypeInt.Content
source: Integer
zh_cn: 整数

# Vars_TypeDouble.Content
source: Decimal
zh_cn: 小数

# Vars_TypeBool.Content
source: Boolean
zh_cn: 布尔

# Vars_TypeString.Content
source: String
zh_cn: 字符串

# Vars_ScopeScheme.Content
source: Scheme
zh_cn: 方案

# Vars_ScopeGlobal.Content
source: Global
zh_cn: 全局

# Vars_SyncNone.Content
source: Off
zh_cn: 不同步

# Vars_SyncSend.Content
source: Send
zh_cn: 发送

# Vars_SyncReceive.Content
source: Receive
zh_cn: 接收

# Vars_SyncBoth.Content
source: Both
zh_cn: 双向

# Vars_ValueBox.ToolTipService.ToolTip
source: Type a new value and press Enter to write it into the running scheme (for debugging)
zh_cn: 输入新值后按回车，立即写入正在运行的方案（调试用）

# Vars_RowMore.ToolTipService.ToolTip
source: More
zh_cn: 更多

# Vars_Empty.Text
source: No variables are declared in this scheme yet. Click "New variable", or run the scheme to see variables created at run time.
zh_cn: 方案中还没有声明变量。点击“新建变量”添加，或者运行方案后在这里查看运行时产生的变量。

# Vars_TableHint.Text
source: Scheme variables have one copy per device; global variables are shared by all devices. Variables with network sync can be read or written by other programs through the sync service. Save the scheme on the Automation page after changing declarations.
zh_cn: 方案变量每台设备各有一份；全局变量由所有设备共享。设置了网络同步的变量可通过同步服务被其他程序读写。修改声明后记得在自动化页保存方案。

# Vars_NameEmpty
source: Name is required
zh_cn: 名称不能为空

# Vars_NameInvalid
source: Use letters, digits, underscores and dots; do not start with a digit
zh_cn: 只能包含字母、数字、下划线和点，且不能以数字开头

# Vars_NameDuplicate
source: A variable with this name already exists
zh_cn: 已有同名变量

# Vars_Remove
source: Remove declaration
zh_cn: 删除声明

# Vars_Declare
source: Declare in scheme
zh_cn: 声明到方案

# Vars_CopyName
source: Copy name
zh_cn: 复制名称

# Vars_SyncCard.Header
source: Variable sync service
zh_cn: 变量同步服务

# Vars_SyncCard.Description
source: Let other programs read, write and subscribe to variables over TCP
zh_cn: 允许其他程序通过 TCP 读取、修改和订阅变量

# Vars_SyncRunning
source: Listening on port {0}, {1} client(s) connected
zh_cn: 正在监听端口 {0}，已连接 {1} 个客户端

# Vars_SyncStopped
source: The service is not running
zh_cn: 服务未运行

# Vars_SyncFailed
source: Could not start: {0}
zh_cn: 启动失败：{0}

# Vars_PortCard.Header
source: Port
zh_cn: 端口

# Vars_PortCard.Description
source: Click "Apply port and token" below after changing
zh_cn: 修改后点击下方“应用端口与令牌”

# Vars_TokenCard.Header
source: Access token
zh_cn: 访问令牌

# Vars_TokenCard.Description
source: Clients must send it when connecting; empty means no authentication (not recommended on a network)
zh_cn: 客户端连接时必须提供；留空表示不验证（不建议在局域网中使用）

# Vars_TokenBox.PlaceholderText
source: No token
zh_cn: 未设置令牌

# Vars_TokenShow.ToolTipService.ToolTip
source: Show or hide the token
zh_cn: 显示/隐藏令牌

# Vars_TokenRegenerate.ToolTipService.ToolTip
source: Generate a new random token and apply it
zh_cn: 生成新的随机令牌并立即应用

# Vars_TokenRegenerateText.Text
source: Regenerate
zh_cn: 重新生成

# Vars_TokenCopy.ToolTipService.ToolTip
source: Copy the token
zh_cn: 复制令牌

# Vars_TokenCopied
source: Token copied to the clipboard.
zh_cn: 令牌已复制到剪贴板。

# Vars_Apply.Content
source: Apply port and token
zh_cn: 应用端口与令牌

# Vars_AddressCard.Header
source: Addresses of this PC
zh_cn: 本机地址

# Vars_NoAddresses
source: No network address available
zh_cn: 没有可用的网络地址

# Vars_ClientsCard.Header
source: Connected clients
zh_cn: 已连接的客户端

# Vars_ClientsCard.Description
source: Name, address, connection time and subscriptions
zh_cn: 名称、地址、连接时间与订阅的变量

# Vars_NoClients.Text
source: No clients connected
zh_cn: 暂无客户端连接

# Vars_ClientLine
source: {0} · {1} · since {2} · subscribed: {3}
zh_cn: {0} · {1} · {2} 起 · 订阅：{3}

# Vars_ProtocolLink.Content
source: Protocol documentation (with Python / C# examples)
zh_cn: 查看协议文档（含 Python / C# 示例）

# Status_SyncRunning
source: Sync service: port {0}, {1} client(s)
zh_cn: 同步服务：端口 {0}，{1} 个客户端

# Status_SyncFailed
source: Sync service: failed to start
zh_cn: 同步服务：启动失败

# Window_Kind
source: Emulator window
zh_cn: 模拟器窗口

# Window_StartMirror
source: Start mirroring
zh_cn: 开始投屏

# Window_StopMirror
source: Stop mirroring
zh_cn: 停止投屏

# Window_StartCapture
source: Start capture
zh_cn: 开始捕获

# Window_StopCapture
source: Stop capture
zh_cn: 停止捕获

# Window_Reconnect
source: Reconnect
zh_cn: 重新连接

# Window_NotStarted
source: The emulator window is not being captured. Click "Start capture" on the Devices page.
zh_cn: 模拟器窗口未在捕获。请在“设备”页点击“开始捕获”。

# Window_Failed
source: Cannot capture the emulator window: {0}
zh_cn: 无法捕获模拟器窗口：{0}

# Window_NotFound
source: No matching window found. Make sure the emulator is running and not minimized, then click "Reconnect".
zh_cn: 找不到匹配的窗口。请确认模拟器已启动且窗口未最小化，然后点击“重新连接”。

# Window_Closed
source: The emulator window was closed.
zh_cn: 模拟器窗口已关闭。

# Window_NoAdbInput
source: This emulator window has no linked adb device: it can be captured and matched but not tapped or typed into. Edit the profile on the Devices page and link an adb device.
zh_cn: 此模拟器窗口没有关联 adb 设备，只能截图和识别，不能点击或输入。请在“设备”页编辑档案并关联 adb 设备。

# Window_AdbOffline
source: The linked adb device {0} is not connected, so input is unavailable.
zh_cn: 关联的 adb 设备 {0} 未连接，无法输入。

# Window_NoAdbShell
source: The current emulator window has no linked adb device, so shell commands cannot run.
zh_cn: 当前模拟器窗口没有关联 adb 设备，无法执行 shell 命令。

# Window_NeedsScrcpy
source: Emulator window devices do not support this action (it needs the scrcpy control channel).
zh_cn: 模拟器窗口设备不支持此操作（需要 scrcpy 控制通道）。

# Window_BindButton.Label
source: Bind emulator window
zh_cn: 绑定模拟器窗口

# Window_EditDevice.ToolTipService.ToolTip
source: Edit emulator profile
zh_cn: 编辑模拟器档案

# Window_ProfilesHeader.Text
source: Emulator profiles
zh_cn: 模拟器档案

# Window_ProfilesEmpty.Text
source: Click "Bind emulator window" above to use an emulator window as a device: the picture comes from the window, input goes through the linked adb device.
zh_cn: 点击右上角“绑定模拟器窗口”，把模拟器窗口当作设备使用：画面来自窗口截图，输入走关联的 adb 设备。

# Window_EditProfile.ToolTipService.ToolTip
source: Edit
zh_cn: 编辑

# Window_RemoveProfile.ToolTipService.ToolTip
source: Remove
zh_cn: 删除

# Window_ProfileSaved
source: Emulator profile "{0}" saved.
zh_cn: 模拟器档案“{0}”已保存。

# Window_ProfileRemoved
source: Emulator profile "{0}" removed.
zh_cn: 模拟器档案“{0}”已删除。

# Window_RemoveTitle
source: Remove emulator profile
zh_cn: 删除模拟器档案

# Window_RemoveConfirm
source: Remove "{0}"? Its window device disappears from the device list.
zh_cn: 确定删除“{0}”吗？对应的窗口设备会从设备列表中移除。

# Window_RemoveYes
source: Remove
zh_cn: 删除

# Window_ClientArea
source: whole client area
zh_cn: 整个客户区

# Window_AdbNone
source: None (capture only)
zh_cn: 不关联（仅截图）

# Window_AdbOfflineChoice
source: {0} (not connected)
zh_cn: {0}（未连接）

# Window_Dialog.PrimaryButtonText
source: Next
zh_cn: 下一步

# Window_DialogTitle
source: Bind emulator window
zh_cn: 绑定模拟器窗口

# Window_DialogEditTitle
source: Edit emulator profile
zh_cn: 编辑模拟器档案

# Window_Next
source: Next
zh_cn: 下一步

# Window_Back
source: Back
zh_cn: 上一步

# Window_Save
source: Save
zh_cn: 保存

# Window_StepWindow
source: Window
zh_cn: 选择窗口

# Window_StepWindowHint
source: Choose the emulator's main window. The live thumbnail on the right confirms it is the right one.
zh_cn: 选择模拟器的主窗口。右侧是实时缩略图，用来确认选对了窗口。

# Window_StepArea
source: Screen area
zh_cn: 画面区域

# Window_StepAreaHint
source: Drag a rectangle around the Android screen on the capture to leave out the emulator's title bar, toolbar and borders; use the whole client area when the screen fills the window.
zh_cn: 在截图上拖出 Android 画面所在的矩形，去掉模拟器的标题栏、工具栏和边框；画面占满窗口时可直接使用整个客户区。

# Window_StepDevice
source: Device and resolution
zh_cn: 设备与分辨率

# Window_StepDeviceHint
source: Link an adb device to tap and type; the reference resolution is the Android screen resolution the picture shows, and all coordinates are expressed in it.
zh_cn: 关联 adb 设备后可以点击和输入；参考分辨率是画面对应的 Android 屏幕分辨率，所有坐标都按它换算。

# Window_StepName
source: Name
zh_cn: 名称

# Window_StepNameHint
source: Name the profile. The match rule finds the window again next time.
zh_cn: 为档案命名。下次启动时按匹配规则重新找到这个窗口。

# Window_Filter.PlaceholderText
source: Filter by title or process
zh_cn: 按标题或进程名筛选

# Window_RefreshWindows.ToolTipService.ToolTip
source: Refresh the window list
zh_cn: 刷新窗口列表

# Window_PreviewHeader.Text
source: Live thumbnail
zh_cn: 实时缩略图

# Window_PreviewNone.Text
source: Choose a window on the left
zh_cn: 选择左侧的窗口

# Window_PreviewLoading
source: Capturing…
zh_cn: 正在捕获…

# Window_PreviewFailed
source: Cannot capture this window: {0}
zh_cn: 无法捕获此窗口：{0}

# Window_PickWindowFirst
source: Choose a window first.
zh_cn: 请先选择一个窗口。
